Autodesk.Revit.DB.ImportUnit
Since:
2013
An enumerated type listing possible target units for CAD Import.
Since:
2013

Autodesk.Revit.DB.ImportUnit.Custom
Custom values as decimal values

Autodesk.Revit.DB.ImportUnit.Meter
Meters as decimal values.

Autodesk.Revit.DB.ImportUnit.Decimeter
Decimeters as decimal values.

Autodesk.Revit.DB.ImportUnit.Centimeter
Centimeters as decimal values.

Autodesk.Revit.DB.ImportUnit.Millimeter
Millimeters as decimal values.

Autodesk.Revit.DB.ImportUnit.Foot
Feet and Inches in fractional notation.

Autodesk.Revit.DB.ImportUnit.Inch
Inches in fractional notation.

Autodesk.Revit.DB.ImportUnit.Default
Unit (if available) from the document that is getting imported.